Tekla Open API Reference for Tekla Structures 2025
PhaseCollection Methods
The PhaseCollection type exposes the following members.
Methods
Name | Description
CopyTo
 Copies the elements of the ICollection to an Array, starting at a particular Array index.
GetEnumerator
 Returns an enumerator that iterates through a collection.
Top
See Also
Reference
PhaseCollection Class
Tekla.Structures.Model Namespace